In [3]:
#Import Dependencies
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [1]:
#Import Code
NGA = "Resources/Crude_oil_NGPL_and_other_liquids_production_Nigeria_Monthly.csv"
NewNGAData = "Resources/DP_LIVE_14102021210027837.csv"

In [9]:
ngadf = pd.read_csv(NGA)
newngadf = pd.read_csv(NewNGAData)

In [12]:
newngadf.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME      Value
0      NGA   OILPROD     TOT    KTOE         A  1991  91829.271
1      NGA   OILPROD     TOT    KTOE         A  1992  95165.881
2      NGA   OILPROD     TOT    KTOE         A  1993  94904.507
3      NGA   OILPROD     TOT    KTOE         A  1994  94407.282
4      NGA   OILPROD     TOT    KTOE         A  1995  95997.992

In [14]:
newngadf = newngadf[["TIME","Value"]]
newngadf.head()

   TIME      Value
0  1991  91829.271
1  1992  95165.881
2  1993  94904.507
3  1994  94407.282
4  1995  95997.992

In [16]:
newngadf = newngadf.rename(columns = {"TIME":"Year","Value":"Barrels Crude Oil Produced Per Day"})

In [19]:
newngadf.head()

   Year  Barrels Crude Oil Produced Per Day
0  1991                           91829.271
1  1992                           95165.881
2  1993                           94904.507
3  1994                           94407.282
4  1995                           95997.992

In [68]:
ngadf.head()

    Month  Series ID: INTL.55-1-NGA-TBPD.M thousand barrels per day
0  Jun-21                                               1653
1  Jun-21                                               1683
2  Jun-21                                               1643
3  Jun-21                                               1688
4  Jun-21                                               1694

In [69]:
TEXAS = "Resources/Texas_Field_Production_of_Crude_Oil.csv"

In [70]:
texasdf = pd.read_csv(TEXAS)

In [71]:
texasdf.head()

    Month  Texas Field Production of Crude Oil Thousand Barrels per Day
0  Jul-21                                               4810
1  Jul-21                                               4782
2  Jul-21                                               4806
3  Jul-21                                               4837
4  Jul-21                                               4728

In [72]:
#Rename Column
ngadf1 = ngadf.rename(columns = {"Series ID: INTL.55-1-NGA-TBPD.M thousand barrels per day":"Barrels Crude Oil Produced Per Day"})
ngadf1

      Month  Barrels Crude Oil Produced Per Day
0    Jun-21                                1653
1    Jun-21                                1683
2    Jun-21                                1643
3    Jun-21                                1688
4    Jun-21                                1694
..      ...                                 ...
337  May-22                                1936
338  May-22                                1936
339  May-22                                1984
340  May-22                                2013
341  May-22                                2032

[342 rows x 2 columns]

In [73]:
texasdf1 = texasdf.rename(columns = {"Texas Field Production of Crude Oil Thousand Barrels per Day":"Barrels Crude Oil Produced Per Day"})
texasdf1

      Month  Barrels Crude Oil Produced Per Day
0    Jul-21                                4810
1    Jul-21                                4782
2    Jul-21                                4806
3    Jul-21                                4837
4    Jul-21                                4728
..      ...                                 ...
482  Nov-22                                2577
483  Nov-22                                2578
484  Nov-22                                2604
485  Nov-22                                2593
486  Nov-22                                2600

[487 rows x 2 columns]

In [74]:
#Rename Columns
ngadf1["Barrels Crude Oil Produced Per Day"] = pd.to_numeric(ngadf1["Barrels Crude Oil Produced Per Day"])
texasdf1["Barrels Crude Oil Produced Per Day"] = pd.to_numeric(texasdf1["Barrels Crude Oil Produced Per Day"])

In [75]:
ngadf1["Barrels Crude Oil Produced Per Day"] = ngadf1["Barrels Crude Oil Produced Per Day"].round()

In [76]:
ngadf1["Barrels Crude Oil Produced Per Day"].astype(int)

0      1653
1      1683
2      1643
3      1688
4      1694
       ...
337    1936
338    1936
339    1984
340    2013
341    2032
Name: Barrels Crude Oil Produced Per Day, Length: 342, dtype: int64

In [77]:
ngadf1["Barrels Crude Oil Produced Per Day"].round()

0      1653
1      1683
2      1643
3      1688
4      1694
       ...
337    1936
338    1936
339    1984
340    2013
341    2032
Name: Barrels Crude Oil Produced Per Day, Length: 342, dtype: float64

In [78]:
pd.set_option('precision',0)

In [79]:
ngadf1

      Month  Barrels Crude Oil Produced Per Day
0    Jun-21                                1653
1    Jun-21                                1683
2    Jun-21                                1643
3    Jun-21                                1688
4    Jun-21                                1694
..      ...                                 ...
337  May-22                                1936
338  May-22                                1936
339  May-22                                1984
340  May-22                                2013
341  May-22                                2032

[342 rows x 2 columns]

In [80]:
ngadf1["Month"] = ngadf1["Month"].astype(str)

In [94]:
ngadf1[['Mon', 'Year']] = ngadf1["Month"].str.split("-", expand=True)
texasdf1[['Mon', 'Year']] =texasdf1["Month"].str.split("-", expand=True)
ngadf1

      Month  Barrels Crude Oil Produced Per Day  Mon Year
0    Jun-21                                1653  Jun   21
1    Jun-21                                1683  Jun   21
2    Jun-21                                1643  Jun   21
3    Jun-21                                1688  Jun   21
4    Jun-21                                1694  Jun   21
..      ...                                 ...  ...  ...
337  May-22                                1936  May   22
338  May-22                                1936  May   22
339  May-22                                1984  May   22
340  May-22                                2013  May   22
341  May-22                                2032  May   22

[342 rows x 4 columns]

In [93]:
monthgroupNGA = ngadf1["Month"].value_counts()
monthgroupNGA

Jan-22    31
Jul-21    31
Dec-21    31
Mar-22    31
Aug-21    31
Oct-21    31
Sep-21    30
Apr-22    30
Nov-21    30
May-22    28
Feb-22    28
Jun-21    10
Name: Month, dtype: int64

In [96]:
monthgroupTexas = texasdf1["Month"].value_counts()
monthgroupTexas

Dec-21    31
Jan-22    31
Aug-22    31
Aug-21    31
Oct-22    31
Mar-22    31
Oct-21    31
May-22    31
Jul-22    31
Sep-22    30
Jun-22    30
Apr-22    30
Nov-21    30
Sep-21    30
Feb-22    28
Nov-22    19
Jul-21    11
Name: Month, dtype: int64

In [101]:
groupNGA = ngadf1.groupby(["Month"]).sum()
groupNGA

        Barrels Crude Oil Produced Per Day
Month
Apr-22                               61421
Aug-21                               62916
Dec-21                               76435
Feb-22                               61474
Jan-22                               71875
Jul-21                               61208
Jun-21                               17016
Mar-22                               66209
May-22                               54486
Nov-21                               66941
Oct-21                               77839
Sep-21                               70504

In [102]:
groupTexas = texasdf1.groupby(["Month"]).sum()
groupTexas

        Barrels Crude Oil Produced Per Day
Month
Apr-22                               38985
Aug-21                              149850
Aug-22                               60602
Dec-21                               34308
Feb-22                               30423
Jan-22                               33218
Jul-21                               50964
Jul-22                               56969
Jun-22                               49565
Mar-22                               35683
May-22                               46122
Nov-21                               48439
Nov-22                               48170
Oct-21                               93192
Oct-22                               75079
Sep-21                              101016
Sep-22                               67569

In [105]:
groupTexas = groupTexas.rename(columns = {"Barrels Crude Oil Produced Per Day":"Barrels Crude Oil Produced Per Day in Texas"})
groupNGA = groupNGA.rename(columns = {"Barrels Crude Oil Produced Per Day":"Barrels Crude Oil Produced Per Day in Nigeria"})

In [136]:
groupTexas
groupTexas.to_csv("TexasData.csv")

In [137]:
groupNGA
groupNGA.to_csv("NigeriaData.csv")

In [20]:
newngadf.to_csv("NewNigeriaData.csv")

In [138]:
# !pip install psycopg2-binary

In [ ]:
# Load

In [147]:
database_path1 = "/Users/anderson/Desktop/RiceLecture/xProject 2 ETL/NigeriaData.csv"

In [148]:
engine = create_engine(f'sqlite://{database_path1}')

In [151]:
engine.table_names()

In [152]:
groupNGA.to_sql(name = 'Nigeria Data', con = engine, if_exists ='append', index = False)

In [22]:
groupTexas.to_sql(name = 'Texas Data', con = engine, if_exists ='append', index = False)

In [ ]:
newngadf.t0_sq;(name = 'New Nigeria Data', con = engine, if_exists ='append', index = False)

In [108]:
#texasdf1[['Mon', 'Year']] =texasdf1["Month"].str.split("-", expand=True)

In [112]:
#texasdf2 = texasdf1[[ 'Mon', 'Year','Barrels Crude Oil Produced Per Day']]
#texasdf2

In [111]:
#texasdf3 = texasdf2.drop(texasdf2.index[342:])
#texasdf3

In [110]:
#ngadf2

In [109]:
#texasdfFINAL = texasdf3.rename(columns = {"Mon":"Month","Barrels Crude Oil Produced Per Day":"Barrels Crude Oil Produced Per Day in Texas"})
#ngadfFINAL = ngadf2.rename(columns = {"Mon":"Month","Barrels Crude Oil Produced Per Day":"Barrels Crude Oil Produced Per Day in Nigeria"})
#texasdfFINAL